Documents/Платежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Платежи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БалансДолжников</xr:Item>
				<xr:Item>AccumulationRegister.Платежи</xr:Item>
				<xr:Item>InformationRegister.ДанныеДоговоров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаФССП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Платежи/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПоказатьКарточку(Команда)
	Если Элементы.Должники.ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(, "Не выбрана строка.", 10);
	Иначе
		СтрокаДолжника = Объект.Должники.НайтиПоИдентификатору(Элементы.Должники.ТекущаяСтрока);
		текДолжник = СтрокаДолжника.Должник;
		ПоказатьЗначение(, текДолжник);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	СвернутьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СвернутьНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Должники.Свернуть("Должник, Договор, ДатаПлатежа", "Сумма");
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры // ()

&НаСервере
Процедура СортироватьНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Должники.Свернуть("Должник, Договор, ДатаПлатежа", "Сумма");
	Об.Должники.Сортировать("Должник, Договор, ДатаПлатежа");
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Сортировать(Команда)
	СортироватьНаСервере();
КонецПроцедуры
